In [2]:
import pandas as pd

# Series object

In [4]:
students = ["Alice", "Jack", "Molly"]

pd.Series(students)

0    Alice
1     Jack
2    Molly
dtype: object

In [5]:
numbers = [1, 2, 3]

pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [6]:
students = ["Alice", "Jack", None]
pd.Series(students)

0    Alice
1     Jack
2     None
dtype: object

In [7]:
numbers = [1, 2, None]

pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [8]:
import numpy as np

np.nan == None

False

In [10]:
np.nan == np.nan

False

In [11]:
np.isnan(np.nan)

True

In [14]:
student_subjects = {"Alice": "Physics",
                   "Jack" : "Chem",
                   "Molly" : "Maths"}

s = pd.Series(student_subjects)
s

Alice    Physics
Jack        Chem
Molly      Maths
dtype: object

In [16]:
s.index

Index(['Alice', 'Jack', 'Molly'], dtype='object')

In [17]:
students = [("Alice", "Brown"), ("Jack", "Willis"), ("Molly", "Davies")]

s = pd.Series(students)

In [18]:
s

0     (Alice, Brown)
1     (Jack, Willis)
2    (Molly, Davies)
dtype: object

In [19]:
s = pd.Series(["Physics", "Chemistry", "Maths"], index=["Alice", "Jack", "Molly"])
s

Alice      Physics
Jack     Chemistry
Molly        Maths
dtype: object

In [20]:
student_subjects = {"Alice": "Physics",
                   "Jack" : "Chem",
                   "Molly" : "Maths"}

s = pd.Series(student_subjects, index=["Alice", "Molly", "Sam"])
s

Alice    Physics
Molly      Maths
Sam          NaN
dtype: object

In [22]:
student_subjects = {"Alice": "Physics",
                   "Jack" : "Chem",
                   "Molly" : "Maths",
                   "Sam" : "Comp Sci"}

s = pd.Series(student_subjects)

s

Alice     Physics
Jack         Chem
Molly       Maths
Sam      Comp Sci
dtype: object

In [23]:
s.iloc[3]

'Comp Sci'

In [24]:
s.loc["Jack"]

'Chem'

In [25]:
s[3]

'Comp Sci'

In [26]:
s.loc["Jack"]

'Chem'

In [27]:
class_code = {99: "Physics",
             100: "Chem",
             101: "Physics",
             102: "Comp Sci"}

c = pd.Series(class_code)

In [28]:
c[0]

KeyError: 0

In [29]:
c.iloc[0]

'Physics'

In [30]:
grades = pd.Series([90, 80, 70, 60, 10, 30, 30, 12, 42, 54, 50, 97])
total = 0
for grade in grades:
    total+=grade

print(total/len(grades))

52.083333333333336

In [31]:
total = np.sum(grades)
print(total/len(grades))

52.083333333333336

In [32]:
grades = pd.Series(np.random.randint(0, 100, 10000))

grades.head()

0    54
1    41
2    12
3    90
4    25
dtype: int32

In [33]:
len(grades)

10000

In [36]:
%%timeit -n 100

total = 0
for grade in grades:
    total+=grade
averag = total/len(grades)

1.22 ms ± 138 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [37]:
%%timeit -n 100

average = np.sum(grades)/len(grades)

97.8 µs ± 21.9 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [38]:
grades+=5

grades.head()

0    59
1    46
2    17
3    95
4    30
dtype: int32

In [51]:
for label, value in grades.items():
    grades.at[label] = value+2

In [44]:
grades.head()

0    61
1    48
2    19
3    97
4    32
dtype: int32

In [49]:
student_subjects = pd.Series({"Alice": "Physics",
                   "Jack" : "Chem",
                   "Molly" : "Maths",
                   "Sam" : "Comp Sci"})

In [46]:
Kelly_Classes = pd.Series(["FM", "Maths", "Physics", "Economics"], index=["Kelly", "Kelly", "Kelly", "Kelly"])
Kelly_Classes

Kelly           FM
Kelly        Maths
Kelly      Physics
Kelly    Economics
dtype: object

In [55]:
all_student_subjects = student_subjects.append(Kelly_Classes)
all_student_subjects

C:\Users\mohka\AppData\Local\Temp\ipykernel_40212\2049188880.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  all_student_subjects = student_subjects.append(Kelly_Classes)

Alice      Physics
Jack          Chem
Molly        Maths
Sam       Comp Sci
Kelly           FM
Kelly        Maths
Kelly      Physics
Kelly    Economics
dtype: object

In [56]:
all_student_subjects.loc["Kelly"]

Kelly           FM
Kelly        Maths
Kelly      Physics
Kelly    Economics
dtype: object

In [57]:
all_student_subjects.iloc[5]

'Maths'

# DataFrames

In [1]:
import pandas as pd

In [2]:
record1 = pd.Series({"Name": "Mark",
                    "Class": "Maths",
                    "Score": 92})

record2 = pd.Series({"Name": "Helen",
                    "Class": "Comp Sci",
                    "Score": 89})

record3 = pd.Series({"Name": "Jenna",
                    "Class": "Physics",
                    "Score": 95})

In [7]:
df = pd.DataFrame([record1, record2, record3], index=["School1", "School2", "School1"])

In [8]:
df.head()

          Name     Class  Score
School1   Mark     Maths     92
School2  Helen  Comp Sci     89
School1  Jenna   Physics     95

In [10]:
students = [{"Name": "Mark",
            "Class": "Maths",
            "Score": 92},
           {"Name": "Helen",
            "Class": "Comp Sci",
            "Score": 89},
           {"Name": "Jenna",
            "Class": "Physics",
            "Score": 95}]

df = pd.DataFrame(students, index=["School1", "School2", "School1"])

In [11]:
df.head()

          Name     Class  Score
School1   Mark     Maths     92
School2  Helen  Comp Sci     89
School1  Jenna   Physics     95

In [12]:
df.loc["School2"]

Name        Helen
Class    Comp Sci
Score          89
Name: School2, dtype: object

In [13]:
type(df.loc["School2"])

pandas.core.series.Series

In [14]:
df.loc["School1"]

          Name    Class  Score
School1   Mark    Maths     92
School1  Jenna  Physics     95

In [15]:
type(df.loc["School1"])

pandas.core.frame.DataFrame

In [16]:
df.loc["School1", "Name"]

School1     Mark
School1    Jenna
Name: Name, dtype: object

In [17]:
df.T

      School1   School2  School1
Name     Mark     Helen    Jenna
Class   Maths  Comp Sci  Physics
Score      92        89       95

In [18]:
df.T.loc["Name"]

School1     Mark
School2    Helen
School1    Jenna
Name: Name, dtype: object

In [19]:
df["Name"]

School1     Mark
School2    Helen
School1    Jenna
Name: Name, dtype: object

In [20]:
df.loc["School1"]["Name"]

School1     Mark
School1    Jenna
Name: Name, dtype: object

In [21]:
df.loc[:, ["Name", "Score"]]

          Name  Score
School1   Mark     92
School2  Helen     89
School1  Jenna     95

In [22]:
df.drop("School1")

          Name     Class  Score
School2  Helen  Comp Sci     89

In [23]:
df

          Name     Class  Score
School1   Mark     Maths     92
School2  Helen  Comp Sci     89
School1  Jenna   Physics     95

In [24]:
copy_df = df.copy()

In [25]:
copy_df.drop("Name", inplace=True, axis=1)

In [26]:
copy_df

            Class  Score
School1     Maths     92
School2  Comp Sci     89
School1   Physics     95

In [27]:
del copy_df["Class"]

In [28]:
copy_df

         Score
School1     92
School2     89
School1     95

In [29]:
df["ClassRanking"] = None
df

          Name     Class  Score ClassRanking
School1   Mark     Maths     92         None
School2  Helen  Comp Sci     89         None
School1  Jenna   Physics     95         None

# DataFrame Indexing and Loading

In [30]:
!cat Admissions_Predict.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [42]:
df = pd.read_csv("Admission_Predict.csv")

In [43]:
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [44]:
df = pd.read_csv("Admission_Predict.csv", index_col=0)
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [45]:
new_df = df.rename(columns={"GRE Score": "GRE Score",
                            "University Rating" : "University Rating",
                            "SOP":"Statement of Purpose", 
                           "LOR":"Letter of Recommendation",
                           "CGPA": "CGPA",
                           "Research":"Research",
                           "Chance of Admit": "Chance of Admit"})

new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [46]:
new_df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'Statement of Purpose',
       'LOR ', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

In [47]:
new_df = new_df.rename(columns={"LOR ": "Letter of Recommendation"})
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recommendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [48]:
new_df = new_df.rename(mapper=str.strip, axis="columns")
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recommendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [50]:
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')

In [51]:
cols = list(df.columns)

In [52]:
cols = [x.lower().strip() for x in cols]
df.columns = cols
df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv("Admission_Predict.csv", index_col = 0)
df.columns = [x.lower().strip() for x in df.columns]

df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [4]:
admit_mask = df["chance of admit"] > 0.7

In [5]:
admit_mask

Serial No.
1       True
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

In [6]:
df.where(admit_mask)

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
396,324.0,110.0,3.0,3.5,3.5,9.04,1.0,0.82
397,325.0,107.0,3.0,3.0,3.5,9.11,1.0,0.84
398,330.0,116.0,4.0,5.0,4.5,9.45,1.0,0.91
399,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
400,333.0,117.0,4.0,5.0,4.0,9.66,1.0,0.95

In [7]:
df.where(admit_mask).dropna().head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
6,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90

In [8]:
df[df["chance of admit"] > 0.7].head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90

In [10]:
df["gre score"].head()

Serial No.
1    337
2    324
3    316
4    322
5    314
Name: gre score, dtype: int64

In [11]:
df[["gre score", "toefl score"]].head()

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [12]:
df[df["gre score"] > 320].head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90
7,321,109,3,3.0,4.0,8.20,1,0.75

In [13]:
(df["chance of admit"] > 0.7) and (df["chance of admit"] < 0.9)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [14]:
(df["chance of admit"] > 0.7) & (df["chance of admit"] < 0.9)

Serial No.
1      False
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398    False
399    False
400    False
Name: chance of admit, Length: 400, dtype: bool

In [15]:
df["chance of admit"].gt(0.7) & df["chance of admit"].lt(0.9)

Serial No.
1      False
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398    False
399    False
400    False
Name: chance of admit, Length: 400, dtype: bool

In [16]:
df["chance of admit"].gt(0.7).lt(0.9)

Serial No.
1      False
2      False
3      False
4      False
5       True
       ...
396    False
397    False
398    False
399     True
400    False
Name: chance of admit, Length: 400, dtype: bool

In [19]:
df["Serial Number"] = df.index
df = df.set_index('Chance of Admit ')
df.head()

KeyError: "None of ['Chance of Admit '] are in the columns"

In [20]:
df

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit,Serial Number
Serial No.,,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92,1
2,324,107,4,4.0,4.5,8.87,1,0.76,2
3,316,104,3,3.0,3.5,8.00,1,0.72,3
4,322,110,3,3.5,2.5,8.67,1,0.80,4
5,314,103,2,2.0,3.0,8.21,0,0.65,5
...,...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82,396
397,325,107,3,3.0,3.5,9.11,1,0.84,397
398,330,116,4,5.0,4.5,9.45,1,0.91,398
399,312,103,3,3.5,4.0,8.78,0,0.67,399
400,333,117,4,5.0,4.0,9.66,1,0.95,400

In [21]:
df["Serial Number"] = df.index

In [22]:
df

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit,Serial Number
Serial No.,,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92,1
2,324,107,4,4.0,4.5,8.87,1,0.76,2
3,316,104,3,3.0,3.5,8.00,1,0.72,3
4,322,110,3,3.5,2.5,8.67,1,0.80,4
5,314,103,2,2.0,3.0,8.21,0,0.65,5
...,...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82,396
397,325,107,3,3.0,3.5,9.11,1,0.84,397
398,330,116,4,5.0,4.5,9.45,1,0.91,398
399,312,103,3,3.5,4.0,8.78,0,0.67,399
400,333,117,4,5.0,4.0,9.66,1,0.95,400

In [23]:
df = df.set_index("chance of admit")

In [24]:
df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,Serial Number
chance of admit,,,,,,,,
0.92,337,118,4,4.5,4.5,9.65,1,1
0.76,324,107,4,4.0,4.5,8.87,1,2
0.72,316,104,3,3.0,3.5,8.00,1,3
0.80,322,110,3,3.5,2.5,8.67,1,4
0.65,314,103,2,2.0,3.0,8.21,0,5

In [25]:
df = df.reset_index()
df.head()

,chance of admit,gre score,toefl score,university rating,sop,lor,cgpa,research,Serial Number
0,0.92,337,118,4,4.5,4.5,9.65,1,1
1,0.76,324,107,4,4.0,4.5,8.87,1,2
2,0.72,316,104,3,3.0,3.5,8.00,1,3
3,0.80,322,110,3,3.5,2.5,8.67,1,4
4,0.65,314,103,2,2.0,3.0,8.21,0,5

In [35]:
df = pd.read_csv("census.csv")

In [36]:
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [37]:
df["SUMLEV"].unique()

array([40, 50], dtype=int64)

In [38]:
df = df[df["SUMLEV"] == 50]
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861
5,50,3,6,1,9,Alabama,Blount County,57322,57322,57373,...,1.807375,-1.177622,-1.748766,-2.062535,-1.369970,1.859511,-0.848580,-1.402476,-1.577232,-0.884411

In [39]:
columns_to_keep = ["STNAME", "CTYNAME", "BIRTHS2010", "BIRTHS2011", "BIRTHS2012", "BIRTHS2013", "BIRTHS2014", "BIRTHS2015", "POPESTIMATE2010", "POPESTIMATE2011", "POPESTIMATE2012", "POPESTIMATE2013", "POPESTIMATE2014", "POPESTIMATE2015"]
df = df[columns_to_keep]
df.head()

,STNAME,CTYNAME,BIRTHS2010,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
1,Alabama,Autauga County,151,636,615,574,623,600,54660,55253,55175,55038,55290,55347
2,Alabama,Baldwin County,517,2187,2092,2160,2186,2240,183193,186659,190396,195126,199713,203709
3,Alabama,Barbour County,70,335,300,283,260,269,27341,27226,27159,26973,26815,26489
4,Alabama,Bibb County,44,266,245,259,247,253,22861,22733,22642,22512,22549,22583
5,Alabama,Blount County,183,744,710,646,618,603,57373,57711,57776,57734,57658,57673

In [41]:
df = df.set_index(["STNAME", "CTYNAME"])

In [42]:
df.head()

                        BIRTHS2010  BIRTHS2011  BIRTHS2012  BIRTHS2013  \
STNAME  CTYNAME
Alabama Autauga County         151         636         615         574
        Baldwin County         517        2187        2092        2160
        Barbour County          70         335         300         283
        Bibb County             44         266         245         259
        Blount County          183         744         710         646

                        BIRTHS2014  BIRTHS2015  POPESTIMATE2010  \
STNAME  CTYNAME
Alabama Autauga County         623         600            54660
        Baldwin County        2186        2240           183193
        Barbour County         260         269            27341
        Bibb County            247         253            22861
        Blount County          618         603            57373

                        POPESTIMATE2011  POPESTIMATE2012  POPESTIMATE2013  \
STNAME  CTYNAME
Alabama Autauga County            55253            55175            55038
        Baldwin County           186659           190396           195126
        Barbour County            27226            27159            26973
        Bibb County               22733            22642            22512
        Blount County             57711            57776            57734

                        POPESTIMATE2014  POPESTIMATE2015
STNAME  CTYNAME
Alabama Autauga County            55290            55347
        Baldwin County           199713           203709
        Barbour County            26815            26489
        Bibb County               22549            22583
        Blount County             57658            57673

In [43]:
df.loc["Michigan", "Washtenaw County"]

BIRTHS2010            977
BIRTHS2011           3826
BIRTHS2012           3780
BIRTHS2013           3662
BIRTHS2014           3683
BIRTHS2015           3709
POPESTIMATE2010    345563
POPESTIMATE2011    349048
POPESTIMATE2012    351213
POPESTIMATE2013    354289
POPESTIMATE2014    357029
POPESTIMATE2015    358880
Name: (Michigan, Washtenaw County), dtype: int64

In [44]:
df.loc[ [("Michigan", "Washtenaw County"), ("Michigan", "Wayne County")] ]

                           BIRTHS2010  BIRTHS2011  BIRTHS2012  BIRTHS2013  \
STNAME   CTYNAME
Michigan Washtenaw County         977        3826        3780        3662
         Wayne County            5918       23819       23270       23377

                           BIRTHS2014  BIRTHS2015  POPESTIMATE2010  \
STNAME   CTYNAME
Michigan Washtenaw County        3683        3709           345563
         Wayne County           23607       23586          1815199

                           POPESTIMATE2011  POPESTIMATE2012  POPESTIMATE2013  \
STNAME   CTYNAME
Michigan Washtenaw County           349048           351213           354289
         Wayne County              1801273          1792514          1775713

                           POPESTIMATE2014  POPESTIMATE2015
STNAME   CTYNAME
Michigan Washtenaw County           357029           358880
         Wayne County              1766008          1759335